In [1]:
import pandas as pd
import numpy as np

In [41]:
df = pd.read_csv('dataset.csv')

In [42]:
# Quiero a la columna Object_Type hacer un split de / y quedarme con el primer elemento
df['Object_Type'] = df['Object_Type'].str.split('/').str[0]

In [32]:
df.head()

,Messier,NGC,Object_Type,Magnitude,Constellation,Distance,Dimensions,Discoverer,Year,Name
0,M1,NGC 1952,Supernova remnant,8,Taurus,6500.0,"6,0' x 4,0'",Bévis,1731.0,Crab Nebula
1,M2,NGC 7089,Globular Cluster,6,Aquarius,55000.0,"11,7'",Maraldi,1746.0,NaN
2,M3,NGC 5272,Globular Cluster,6,Canes Venatici,48500.0,"18,6'",Messier,1764.0,NaN
3,M4,NGC 6121,Globular Cluster,5,Scorpius,9900.0,"22,8'",Chéseaux,1746.0,NaN
4,M5,NGC 5904,Globular Cluster,5,Serpens,24800.0,"19,9'",Kirch,1702.0,NaN

In [33]:
df.shape

(110, 10)

In [34]:
# Drop column
df.drop('Name', axis=1, inplace=True)

In [37]:
df.dropna(inplace=True)

In [47]:
sorted(df['Year'])

[1610.0,
 1654.0,
 1654.0,
 1654.0,
 1654.0,
 1654.0,
 1654.0,
 1660.0,
 1665.0,
 1680.0,
 1681.0,
 1702.0,
 1710.0,
 1714.0,
 1731.0,
 1746.0,
 1746.0,
 1746.0,
 1749.0,
 1764.0,
 nan,
 1746.0,
 1746.0,
 1746.0,
 1746.0,
 1746.0,
 1749.0,
 1749.0,
 1750.0,
 1750.0,
 1751.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 1764.0,
 nan,
 1764.0,
 1764.0,
 nan,
 nan,
 1751.0,
 1751.0,
 1771.0,
 1771.0,
 1771.0,
 1771.0,
 1773.0,
 1773.0,
 1774.0,
 1774.0,
 1774.0,
 1775.0,
 1775.0,
 1777.0,
 1778.0,
 1778.0,
 1779.0,
 1779.0,
 1779.0,
 1779.0,
 1779.0,
 1779.0,
 1779.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1780.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1781.0,
 1782.0,
 1782.0,
 1782.0]